src/projects/configuration/251027_GKSTCPLK-1788/src/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПоказателиУсиленногоКонтроляПоРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Базис</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСтатусКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияРегистрации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛабораторныйАнализ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЛабораторныйАнализ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/Enums/гкс_НазначенияИспользованияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_НазначенияИспользованияКачества</Name>
			<Comment>ERP-2184</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приемка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемкаКомпозит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлеваторВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛаборантВнешниеПробы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпозитВнешниеПробыНаТысячуТон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПромежуточныйКомпозит</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/Enums/гкс_СостоянияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияКачества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОбщегоРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПробыНеТребуются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет пустые значения НазначенияИспользования значением "Приемка"
// для всех существующих записей в регистре
//
// Параметры:
//   ПараметрыОбновления - Структура - параметры обработчика обновления
//
Процедура ЗаполнитьПустыеНазначенияИспользованияПриемкой(ПараметрыОбновления = Неопределено) Экспорт
	
	СобытиеЖурнала = ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации();
	НазначениеПриемка = Перечисления.гкс_НазначенияИспользованияКачества.Приемка;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	гкс_ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации КАК ДокументРегистрации,
		|	гкс_ПоказателиУсиленногоКонтроляПоРегистрации.Показатель КАК Показатель,
		|	гкс_ПоказателиУсиленногоКонтроляПоРегистрации.ЛабораторныйАнализ КАК ЛабораторныйАнализ
		|ИЗ
		|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК гкс_ПоказателиУсиленногоКонтроляПоРегистрации
		|ГДЕ
		|	гкс_ПоказателиУсиленногоКонтроляПоРегистрации.НазначениеИспользования = ЗНАЧЕНИЕ(Перечисление.гкс_НазначенияИспользованияКачества.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	гкс_ПоказателиУсиленногоКонтроляПоРегистрации.ДокументРегистрации,
		|	гкс_ПоказателиУсиленногоКонтроляПоРегистрации.Показатель,
		|	гкс_ПоказателиУсиленногоКонтроляПоРегистрации.ЛабораторныйАнализ
		|ИЗ
		|	РегистрСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации КАК гкс_ПоказателиУсиленногоКонтроляПоРегистрации
		|ГДЕ
		|	гкс_ПоказателиУсиленногоКонтроляПоРегистрации.СостояниеКачества = ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияКачества.ПустаяСсылка)
		|	И НЕ гкс_ПоказателиУсиленногоКонтроляПоРегистрации.УдалитьСтатусКачества = ЗНАЧЕНИЕ(Перечисление.гкс_СостоянияРегистрации.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	КоличествоОбновленных = 0;
	
	НаборЗаписей = РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			НаборЗаписей.Отбор.ДокументРегистрации.Установить(Выборка.ДокументРегистрации);
			НаборЗаписей.Отбор.Показатель.Установить(Выборка.Показатель);
			НаборЗаписей.Отбор.ЛабораторныйАнализ.Установить(Выборка.ЛабораторныйАнализ);
			
			НаборЗаписей.Прочитать();

			Для Каждого Запись Из НаборЗаписей Цикл
				Если Не ЗначениеЗаполнено(Запись.НазначениеИспользования) Тогда
					Запись.НазначениеИспользования = НазначениеПриемка;
				КонецЕсли;	
				Если Не ЗначениеЗаполнено(Запись.СостояниеКачества)
					И ЗначениеЗаполнено(Запись.УдалитьСтатусКачества) Тогда
					Запись.СостояниеКачества = СтатусКачестваПоСоответсвию(Запись.УдалитьСтатусКачества);
				КонецЕсли;	
			КонецЦикла;
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
			КоличествоОбновленных = КоличествоОбновленных + 1;
				
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			
			ИнфоОбОшибке = ИнформацияОбОшибке();
			ПодробноеПредставление = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнфоОбОшибке);
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не удалось обработать запись регистра гкс_ПоказателиУсиленногоКонтроляПоРегистрации 
				|по причине: %1'"), ПодробноеПредставление);
			ЗаписьЖурналаРегистрации(СобытиеЖурнала, УровеньЖурналаРегистрации.Предупреждение,
				Метаданные.РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации, , ТекстСообщения);
		КонецПопытки;
		
	КонецЦикла;
	
	ТекстСообщенияУспех = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Обновлено записей в РС гкс_ПоказателиУсиленногоКонтроляПоРегистрации: %1. 
				|Заполнено НазначениеИспользования = Приемка для пустых значений.'"), КоличествоОбновленных);
	ЗаписьЖурналаРегистрации(
		СобытиеЖурнала, УровеньЖурналаРегистрации.Информация,
		Метаданные.РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации, , ТекстСообщенияУспех);
	
КонецПроцедуры


#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

Функция СтатусКачестваПоСоответсвию(СтатусКачества)
	
	Если СтатусКачества = Перечисления.гкс_СостоянияРегистрации.КачествоПринято Тогда
		Результат = Перечисления.гкс_СостоянияКачества.КачествоПринято;
	ИначеЕсли СтатусКачества = Перечисления.гкс_СостоянияРегистрации.КачествоНеПринято Тогда
		Результат = Перечисления.гкс_СостоянияКачества.КачествоНеПринято;
	ИначеЕсли СтатусКачества = Перечисления.гкс_СостоянияРегистрации.ВзятыПробы Тогда
		Результат = Перечисления.гкс_СостоянияКачества.ОтборПроб;
	Иначе
		Результат = Перечисления.гкс_СостоянияКачества.ПустаяСсылка();	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции	
#КонецОбласти   

#КонецЕсли
